# NAIVE BAYSE - GAUSSIAN

This algorithm is used for the EMAIL SPAM DETECTION , HAND WRITTEN NUMBER IDENTIFICATION , WEATHER PREDICTION , NEWS ARTICLE DETECTION , FACE DETECTION ...

Startup :

Probabilty ... head tails ... cards gaming queen ...

Conditional probability -> find the probability of event A  given that the event B has already occured ... This euation was presented by the Thomus Bayes ...

Now this is called naive bcz we make a naive (bholi bhali) assumption that the features (already occured) are independent of each other ...  As they might be not in real

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

Now we have to find the probability of the survived given that the features ...

In [3]:
df=df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis=1) # Name ka kuch lena dena ni predictions pe
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
dummies = pd.get_dummies(df.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [5]:
df = pd.concat([df,dummies],axis=1)
df.head()

   Pclass     Sex   Age     Fare  Survived  female  male
0       3    male  22.0   7.2500         0       0     1
1       1  female  38.0  71.2833         1       1     0
2       3  female  26.0   7.9250         1       1     0
3       1  female  35.0  53.1000         1       1     0
4       3    male  35.0   8.0500         0       0     1

In [6]:
df=df.drop('Sex',axis=1)
df.head()

   Pclass   Age     Fare  Survived  female  male
0       3  22.0   7.2500         0       0     1
1       1  38.0  71.2833         1       1     0
2       3  26.0   7.9250         1       1     0
3       1  35.0  53.1000         1       1     0
4       3  35.0   8.0500         0       0     1

In [7]:
df.columns

Index(['Pclass', 'Age', 'Fare', 'Survived', 'female', 'male'], dtype='object')

In [10]:
df.isna()

     Pclass    Age   Fare  Survived  female   male
0     False  False  False     False   False  False
1     False  False  False     False   False  False
2     False  False  False     False   False  False
3     False  False  False     False   False  False
4     False  False  False     False   False  False
..      ...    ...    ...       ...     ...    ...
886   False  False  False     False   False  False
887   False  False  False     False   False  False
888   False   True  False     False   False  False
889   False  False  False     False   False  False
890   False  False  False     False   False  False

[891 rows x 6 columns]

In [11]:
df.isna().any() # jesse df.fillna ke liye krte wese hi df.isna()

Pclass      False
Age          True
Fare        False
Survived    False
female      False
male        False
dtype: bool

In [14]:
df.columns[0]

'Pclass'

In [15]:
df.columns[df.isna().any()]

Index(['Age'], dtype='object')

In [26]:
df.Age.fillna(df.Age.mean(),inplace=True)
df.tail()

     Pclass        Age   Fare  Survived  female  male
886       2  27.000000  13.00         0       0     1
887       1  19.000000  30.00         1       1     0
888       3  29.699118  23.45         0       1     0
889       1  26.000000  30.00         1       0     1
890       3  32.000000   7.75         0       0     1

In [27]:
inputs = df.drop('Survived',axis=1)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [28]:
target = df.Survived
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [30]:
from sklearn.model_selection import train_test_split

In [39]:
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [32]:
len(X_train)

712

In [33]:
len(X_test)

179

In [34]:
len(inputs)

891

In [35]:
from sklearn.naive_bayes import GaussianNB  # GaussianNB is for normal distribution ... Also called Bell curved ... normal distribution is that you study in the statistics class

In [40]:
model = GaussianNB() # So , we are here using the Gausssian Naive Bayes

In [41]:
model.fit(X_train,y_train)

GaussianNB()

In [42]:
model.score(X_test,y_test)

0.7932960893854749

In [47]:
X_test[0:10]

     Pclass        Age     Fare  female  male
666       2  25.000000  13.0000       0     1
835       1  39.000000  83.1583       1     0
100       3  28.000000   7.8958       1     0
551       2  27.000000  26.0000       0     1
271       3  25.000000   0.0000       0     1
200       3  28.000000   9.5000       0     1
653       3  29.699118   7.8292       1     0
489       3   9.000000  15.9000       0     1
425       3  29.699118   7.2500       0     1
887       1  19.000000  30.0000       1     0

In [48]:
y_test[0:10]

666    0
835    1
100    0
551    0
271    1
200    0
653    1
489    1
425    0
887    1
Name: Survived, dtype: int64

In [49]:
model.predict(X_test[0:10])

array([0, 1, 1, 0, 0, 0, 1, 0, 0, 1], dtype=int64)

**So match the results ... Its almost working up to the mark**

In [50]:
model.predict_proba(X_test[0:10]) # here the class is survived or not

array([[0.97879642, 0.02120358],
       [0.00174537, 0.99825463],
       [0.08946009, 0.91053991],
       [0.97829867, 0.02170133],
       [0.98956229, 0.01043771],
       [0.99074898, 0.00925102],
       [0.09089805, 0.90910195],
       [0.98687497, 0.01312503],
       [0.99079468, 0.00920532],
       [0.00938606, 0.99061394]])